###################################################################

# Created by write_sdc on Thu Mar 15 11:28:29 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 3.0e+06
set_load -pin_load 57.462 [get_ports {SM1_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM1_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM1_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM1_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM1_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM2_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM2_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM2_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM2_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM2_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM3_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM3_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM3_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM3_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM3_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM4_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM4_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM4_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM4_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM4_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM5_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM5_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM5_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM5_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM5_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM6_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM6_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM6_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM6_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM6_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM7_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM7_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM7_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM7_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM7_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM8_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM8_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM8_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM8_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM8_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM9_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM9_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM9_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM9_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM9_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM10_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM10_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM10_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM10_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM10_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM11_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM11_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM11_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM11_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM11_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM12_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM12_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM12_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM12_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM12_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM13_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM13_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM13_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM13_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM13_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM14_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM14_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM14_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM14_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM14_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM15_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM15_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM15_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM15_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM15_remaining[0]}]
set_load -pin_load 57.462 [get_ports {SM16_remaining[4]}]
set_load -pin_load 57.462 [get_ports {SM16_remaining[3]}]
set_load -pin_load 57.462 [get_ports {SM16_remaining[2]}]
set_load -pin_load 57.462 [get_ports {SM16_remaining[1]}]
set_load -pin_load 57.462 [get_ports {SM16_remaining[0]}]
create_clock [get_ports clk_sm]  -period 1500  -waveform {0 750}
